In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('messy_data.csv')

In [3]:
df.head()

,TrnsnID,Data,CusmrID,ProdtID,ProdtName,Qutity,Prize,TtlSales,PaymentType,CusterAge
0,7402,03/17/2026,991,1045,Boo E,9,167.72,2935.06,NaN,87
1,5835,26-01-2035,741,1040,Book J,18,193.27,4386.52,debit card,69
2,2123,05/26/2035,933,1062,Bok N,5,126.39,1948.46,Cash,15
3,8789,28-02-2036,641,1060,Book I,6,66.98,1757.26,Cash,22
4,305,19-04-2023,123,1058,Book B,15,33.63,2578.19,Cash,-1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10100 non-null  int64
 1   Data         10100 non-null  object
 2   CusmrID      10100 non-null  int64
 3   ProdtID      10100 non-null  int64
 4   ProdtName    9098 non-null   object
 5   Qutity       10100 non-null  int64
 6   Prize        10100 non-null  float64
 7   TtlSales     10100 non-null  float64
 8   PaymentType  8645 non-null   object
 9   CusterAge    10100 non-null  int64
dtypes: float64(2), int64(5), object(3)
memory usage: 789.2+ KB

In [5]:
df.isnull().sum()

TrnsnID           0
Data              0
CusmrID           0
ProdtID           0
ProdtName      1002
Qutity            0
Prize             0
TtlSales          0
PaymentType    1455
CusterAge         0
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   TrnsnID      10100 non-null  int64
 1   Data         10100 non-null  object
 2   CusmrID      10100 non-null  int64
 3   ProdtID      10100 non-null  int64
 4   ProdtName    9098 non-null   object
 5   Qutity       10100 non-null  int64
 6   Prize        10100 non-null  float64
 7   TtlSales     10100 non-null  float64
 8   PaymentType  8645 non-null   object
 9   CusterAge    10100 non-null  int64
dtypes: float64(2), int64(5), object(3)
memory usage: 789.2+ KB

Renaming columns

In [7]:
df.rename(columns={'TrnsnID': 'Transaction_ID'}, inplace=True)

In [8]:
df.rename(columns={'CusmrID': 'Customer_ID'}, inplace=True)

In [9]:
df.rename(columns={'ProdtID': 'Product_ID'}, inplace=True)

In [10]:
df.rename(columns={'Qutity': 'Quantity'}, inplace=True)

In [11]:
df.rename(columns={'Prize': 'Price'}, inplace=True)

In [12]:
df.rename(columns={'TtlSales': 'Total_Sales'}, inplace=True)

In [13]:
df.rename(columns={'CusterAge': 'Customer_Age'}, inplace=True)

In [14]:
df.rename(columns={'Data': 'Date'}, inplace=True)

In [15]:
df.rename(columns={'ProdtID': 'Product_ID'}, inplace=True)

In [16]:
df.rename(columns={'ProdtName': 'Product_Name'}, inplace=True)

In [17]:
df.rename(columns={'PaymentType': 'Payment_Method'}, inplace=True)

In [18]:
df.sample(5)

,Transaction_ID,Date,Customer_ID,Product_ID,Product_Name,Quantity,Price,Total_Sales,Payment_Method,Customer_Age
667,796,20-08-2032,561,1080,Book O,17,25.83,2321.70,Debit,93
4523,480,08/22/2026,581,1056,Bok N,5,119.83,593.73,Credit,85
121,4906,07/06/2024,735,1056,Boo E,4,198.79,4332.32,Credit Card,63
5829,5529,19-08-2024,306,1013,Book T,14,19.48,2508.31,Credit,82
7415,924,04/07/2032,814,1004,Book D,17,173.16,355.19,NaN,64

In [19]:
df.isnull().sum()

Transaction_ID       0
Date                 0
Customer_ID          0
Product_ID           0
Product_Name      1002
Quantity             0
Price                0
Total_Sales          0
Payment_Method    1455
Customer_Age         0
dtype: int64

filling missing values with previous value

In [20]:
df = df.fillna(method='bfill')

Converted Date column to appropraite data type

In [21]:
df['Date'] = pd.to_datetime(df['Date'], format='mixed')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10100 entries, 0 to 10099
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction_ID  10100 non-null  int64
 1   Date            10100 non-null  datetime64[ns]
 2   Customer_ID     10100 non-null  int64
 3   Product_ID      10100 non-null  int64
 4   Product_Name    10100 non-null  object
 5   Quantity        10100 non-null  int64
 6   Price           10100 non-null  float64
 7   Total_Sales     10100 non-null  float64
 8   Payment_Method  10100 non-null  object
 9   Customer_Age    10100 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(2)
memory usage: 789.2+ KB

Handled negative values using absolute method

In [23]:
df['Customer_Age'] = df['Customer_Age'].abs()
df['Quantity'] = df['Quantity'].abs()

Recalculated total sales with product of sales and quantity

In [24]:
df['Total_Sales'] = df['Quantity'] * df['Price']

In [25]:
df.head()

,Transaction_ID,Date,Customer_ID,Product_ID,Product_Name,Quantity,Price,Total_Sales,Payment_Method,Customer_Age
0,7402,2026-03-17,991,1045,Boo E,9,167.72,1509.48,debit card,87
1,5835,2035-01-26,741,1040,Book J,18,193.27,3478.86,debit card,69
2,2123,2035-05-26,933,1062,Bok N,5,126.39,631.95,Cash,15
3,8789,2036-02-28,641,1060,Book I,6,66.98,401.88,Cash,22
4,305,2023-04-19,123,1058,Book B,15,33.63,504.45,Cash,1

In [26]:
df.isnull().sum()

Transaction_ID    0
Date              0
Customer_ID       0
Product_ID        0
Product_Name      0
Quantity          0
Price             0
Total_Sales       0
Payment_Method    0
Customer_Age      0
dtype: int64

Removed duplicate values using customer id and product id as a subset since same customer can buy different items

In [27]:
dff = df.drop_duplicates(subset=['Customer_ID', 'Product_ID'], keep='first')

In [28]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9481 entries, 0 to 10097
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction_ID  9481 non-null   int64
 1   Date            9481 non-null   datetime64[ns]
 2   Customer_ID     9481 non-null   int64
 3   Product_ID      9481 non-null   int64
 4   Product_Name    9481 non-null   object
 5   Quantity        9481 non-null   int64
 6   Price           9481 non-null   float64
 7   Total_Sales     9481 non-null   float64
 8   Payment_Method  9481 non-null   object
 9   Customer_Age    9481 non-null   int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(2)
memory usage: 814.8+ KB